# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Practicas\LedJoselito\Design01.cydsn\Design01.cyprj
# Date: Fri, 12 May 2017 11:22:00 GMT
#set_units -time ns
create_clock -name {Clock_1(routed)} -period 10000000 -waveform {0 5000000} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {Clock_2(routed)} -period 2730666.6666666665 -waveform {0 1365333.33333333} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 65537 131073} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 240001 480001} [list [get_pins {ClockBlock/dclk_glb_0}]]


# Component constraints for C:\Practicas\LedJoselito\Design01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Practicas\LedJoselito\Design01.cydsn\Design01.cyprj
# Date: Fri, 12 May 2017 11:21:55 GMT
