# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Practicas\PracticasDSECompleto\Practica4Parte2.cydsn\Practica4Parte2.cyprj
# Date: Sun, 14 May 2017 18:03:55 GMT
#set_units -time ns
create_clock -name {Clock_1(routed)} -period 41666.666666666664 -waveform {0 20833.3333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2001 4001} -nominal_period 41666.666666666664 [list [get_pins {ClockBlock/dclk_glb_0}]]


# Component constraints for C:\Practicas\PracticasDSECompleto\Practica4Parte2.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Practicas\PracticasDSECompleto\Practica4Parte2.cydsn\Practica4Parte2.cyprj
# Date: Sun, 14 May 2017 18:03:47 GMT
